Revit 2027 API
BuiltInFailures.SiteFailures.PropertyIntersect Property
 Property lines intersect. Area calculations will not be precise.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PropertyIntersect { get; }
Public Shared ReadOnly Property PropertyIntersect As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PropertyIntersect {
	FailureDefinitionId^ get ();
}
static member PropertyIntersect : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SiteFailures Class
Autodesk.Revit.DB Namespace